app/controllers/guests_controller.rb

INSERT INTO "guests" ("name", "email", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "swapnil"], ["email", ""], ["created_at", "2018-01-20 14:31:50.566979"], ["updated_at", "2018-01-20 14:31:50.566979"]]
---
  def create
  	@guest = Guest.new(guest_params)
  	if @guest.save