app/controllers/hotels_controller.rb

  def create
		@hotel = Hotel.new(hotel_params)
		if @hotel.save
---
INSERT INTO "hotels" ("name", "email", "phone", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["name", "Tryluck "], ["email", "joy.brook09@outlook.com"], ["phone", "9876541230"], ["created_at", "2018-01-20 19:33:30.080065"], ["updated_at", "2018-01-20 19:33:30.080065"]]