app/controllers/hotel_seats_controller.rb

  def create_hotel_seat
   @table = @hotel.hotel_seats.new(seat_params)
   if @table.save
---
INSERT INTO "hotel_seats" ("name", "minimum_seats", "maximum_seats", "hotel_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["name", "table"], ["minimum_seats", "2"], ["maximum_seats", "8"], ["hotel_id", 2], ["created_at", "2018-01-20 15:29:10.488552"], ["updated_at", "2018-01-20 15:29:10.488552"]]

	def set_hotel
  	@hotel = Hotel.find(params[:id])
---
SELECT  "hotels".* FROM "hotels" WHERE "hotels"."id" = $1 LIMIT 1  [["id", 2]]