app/controllers/reservations_controller.rb

	def index
    @hotel = Hotel.find(params[:hotel_id])
---
SELECT  "hotels".* FROM "hotels" WHERE "hotels"."id" = $1 LIMIT 1  [["id", 1]]

  def create
		if reservation_available?(matched_shift_time, match_guest_count)
      @reservation = Reservation.new(reservation_params)
      if @reservation.save
---
INSERT INTO "reservations" ("guest_count", "booking_day", "hotel_seat_id", "guest_id", "hotel_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"

 def update
    if reservation_available?(matched_shift_time, match_guest_count)
      modify_reservation_attributes(params)
        if @reservation.save!
---
UPDATE "reservations" SET "booking_day" = $1, "booking_day_updated" = $2, "updated_at" = $3 WHERE "reservations"."id" = $4  [["booking_day", "2018-01-22 16:30:00.000000"], ["booking_day_updated", "2018-01-23 12:30:00.000000"], ["updated_at", "2018-01-21 09:46:59.146667"], ["id", 1]]

	def set_hotel_seat
   @hotel_seat = HotelSeat.find(params[:reservations][:hotel_seat_id])
---
SELECT  "hotel_seats".* FROM "hotel_seats" WHERE "hotel_seats"."id" = $1 LIMIT 1  [["id", nil]]
SELECT "reservations".* FROM "reservations" WHERE "reservations"."hotel_seat_id" = $1 AND (booking_day BETWEEN '2018-01-22 18:30:00.000000' AND '2018-01-23 18:29:59.999999')  [["hotel_seat_id", 3]]

  def set_guest
    @guest = Guest.find(params[:guest_id])
---
SELECT  "guests".* FROM "guests" WHERE "guests"."id" = $1 LIMIT 1  [["id", 1]]