app/controllers/working_shifts_controller.rb

 def create_working_shift
   working_shifts = @hotel.working_shifts.create(shift_params)
---
INSERT INTO "working_shifts" ("start_time", "end_time", "hotel_id", "created_at", "updated_at", "shift_type") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["start_time", "08:00:00"], ["end_time", "13:00:00"], ["hotel_id", 2], ["created_at", "2018-01-20 13:32:14.499986"], ["updated_at", "2018-01-20 13:32:14.499986"], ["shift_type", "Morning"]]

 def set_hotel
  @hotel = Hotel.find(params[:id])
---
SELECT  "hotels".* FROM "hotels" WHERE "hotels"."id" = $1 LIMIT 1  [["id", 2]]